#جداسازی کد اپراتور موبایل
#یک شماره موبایل 11 رقمی از کاربر دریافت کنید 
#با استفاده از slicing سه رقم بعد صفر را نمایش دهید
#حتما یادم باشه قبل هر جمله ای ک کاربر قراره ببینه باید input  بذارم 
#وگرنه متغیر اونو به عنوان مقدار خودش میبینه و بعدا ارور میده
#نکته دیگه ای که از این سوال یادگرفتم: int نمیتونن داخل index , slicing  قرار بگیرند
#در صورتی میگیم عدد خروجی نهایی مون رو به int  تبدیل کن ک بخواییم محاسبه ای انجام بدیم

text = input("enter your phone number : ")
a4 = text[1: 4: 1]
print(a4)