#یک رشته را دریافت کنید 
#اگر طول رشته زوج بود نیم اول چاپ کن
#اگر طول رشته فرد بود نیمه دوم چاپ کن
#الگوریتم مینویسم:
#ورودی : یک رشته
#خروجی: چاپ نیمی از رشته بر یک اساسی
#چه کار باید انجام بشه؟ تعداد حروف رشته را به دست بیارم
#محاسبه تعداد زوج یا فرد بودنش
#اگر زوج باشه نیم اول چاپ شه
#اگر فرد باشه نیم دوم چاپ شه

#start
name = input("enter your name:")
if len(name) % 2 == 0:
#این جمله بالا یعنی بفهمیم زوج یا نه
    print(name[0: len(name) // 2])
#توضیح جمله بالا یعنی از 0 اولین کارکتر تا دو نقطه که دیگه جلوش عدد نذاشتم یعنی هر جا ک طول رشته بود
#به دو قسمت تقسیم کن 2 // 
else:
    print(name[len(name) // 2 + 1:])
    